In [26]:
%pylab inline
import pandas as pd
import seaborn

Populating the interactive namespace from numpy and matplotlib

# Loaded Data into Memory

In [28]:
data = pd.read_csv(r'Desktop\uber-raw-data-apr14.csv')

In [31]:
data.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [32]:
data['Date/Time'].head()

0    4/1/2014 0:11:00
1    4/1/2014 0:17:00
2    4/1/2014 0:21:00
3    4/1/2014 0:28:00
4    4/1/2014 0:33:00
Name: Date/Time, dtype: object

In [35]:
data['Date/Time'] = data['Date/Time'].map(pd.to_datetime)
data.head()

            Date/Time      Lat      Lon    Base
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512

In [37]:
data.head(1)

            Date/Time     Lat      Lon    Base
0 2014-04-01 00:11:00  40.769 -73.9549  B02512

In [40]:
def get_dom(dt):
    return dt.day

data['DOM'] = data['Date/Time'].map(get_dom)

In [41]:
data.head()

            Date/Time      Lat      Lon    Base  DOM
0 2014-04-01 00:11:00  40.7690 -73.9549  B02512    1
1 2014-04-01 00:17:00  40.7267 -74.0345  B02512    1
2 2014-04-01 00:21:00  40.7316 -73.9873  B02512    1
3 2014-04-01 00:28:00  40.7588 -73.9776  B02512    1
4 2014-04-01 00:33:00  40.7594 -73.9722  B02512    1

In [47]:
def get_hour(dt):
    return dt.hour
data['Hour'] = data['Date/Time'].map(get_hour)

def get_weekday(dt):
    return dt.weekday()
data['Weekday'] = data['Date/Time'].map(get_weekday)

In [48]:
data.tail()

                 Date/Time      Lat      Lon    Base  DOM  Hour  Weekday
564511 2014-04-30 23:22:00  40.7640 -73.9744  B02764   30    23        2
564512 2014-04-30 23:26:00  40.7629 -73.9672  B02764   30    23        2
564513 2014-04-30 23:31:00  40.7443 -73.9889  B02764   30    23        2
564514 2014-04-30 23:32:00  40.6756 -73.9405  B02764   30    23        2
564515 2014-04-30 23:48:00  40.6880 -73.9608  B02764   30    23        2